EdgeProIOT/incubator-nuttx/boards/arm/imxrt/imxrt1170-evk/src/imxrt_ads1278.c
/****************************************************************************
 * boards/arm/imxrt/imxrt1170-evk/src/imxrt_ads1278.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <unistd.h>
#include <string.h>
#include <fcntl.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>
#include <math.h>

#include <nuttx/arch.h>
#include <nuttx/mutex.h>
#include <nuttx/fs/fs.h>
#include <nuttx/irq.h>
#include <nuttx/wqueue.h>
#include <nuttx/analog/adc.h>
#include <nuttx/analog/ioctl.h>

#include "imxrt_config.h"
#include "imxrt_gpio.h"

#include "imxrt1170-evk.h"

#include "hardware/imxrt_pinmux.h"
#include "hardware/imxrt_flexio.h"
#include "hardware/imxrt_ccm.h"
#include "hardware/imxrt_dmamux.h"
#include "imxrt_flexio.h"
#include "imxrt_edma.h"
#include "imxrt_periphclks.h"

#include <arch/board/board.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define FLEXIO_BCLK_PIN                 (13u)
#define FLEXIO_FRAME_SYNC_PIN           (12u)
#define FLEXIO_RX_DATA_PIN              (10u)
#define FLEXIO_BCLK_TIMER_INDEX         0
#define FLEXIO_FS_TIMER_INDEX           1
#define FLEXIO_RX_SHIFTER_INDEX         0

#define FLEXIO_SRC_CLK_HZ               30000000u
#define FLEXIO_ADS1278_WORD_WIDTH       32u
#define FLEXIO_ADS1278_SAMPLE_RATE_HZ   9766u

#define SIGN_EXTEND_24BIT(x) (x) = (uint32_t)((((int32_t)x) << 8) >> 8)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This describes a FIFO of ADS1278 samples */

struct ads1278_fifo_s
{
  sem_t    sem;                          /* Counting semaphore */
  uint8_t  head;                         /* Index to the head [IN] index in the circular buffer */
  uint8_t  tail;                         /* Index to the tail [OUT] index in the circular buffer */
  uint32_t buffer[2];
};

struct ads1278_dev_s
{
  struct flexio_dev_s   *flexio;
  const unsigned int    dma_rxreqsrc;   /* DMAMUX source of RX DMA request */
  DMACH_HANDLE          rxdma;          /* DMA channel handle for RX transfers */
  uint32_t              rxbuf[512];      /* RX buffer (2 x 16 samples) */
  uint8_t               ocount;         /* The number of times the device has been opened */
  uint8_t               nrxwaiters;     /* Number of threads waiting to enqueue a message */
  mutex_t               closelock;      /* Locks out new opens while close is in progress */
  struct ads1278_fifo_s recv;           /* Describes receive FIFO */
  bool                  isovr;          /* Flag to indicate an overrun */

  /* The following is a list of poll structures of threads waiting for
   * driver events.  The 'struct pollfd' reference for each open is also
   * retained in the f_priv field of the 'struct file'.
   */

  struct pollfd *fds[CONFIG_ADS1278_NPOLLWAITERS];

};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static void         ads1278_dmarxcallback(DMACH_HANDLE handle, void *arg,
                                          bool done, int result);
static inline void  ads1278_dmarxstart(struct ads1278_dev_s *dev);
static int          ads1278_open(FAR struct file *filep);
static int          ads1278_close(FAR struct file *filep);
static ssize_t      ads1278_read(FAR struct file *fielp, FAR char *buffer,
                                 size_t buflen);
static int          ads1278_ioctl(FAR struct file *filep, int cmd,
                                  unsigned long arg);
static void         ads1278_receive(FAR struct ads1278_dev_s *dev,
                                    uint32_t *rxbuf);
static void         ads1278_notify(FAR struct ads1278_dev_s *dev);
static int          ads1278_poll(FAR struct file *filep, struct pollfd *fds,
                                 bool setup);
static int          ads1278_reset_fifo(FAR struct ads1278_dev_s *dev);
static void         ads1278_initialize(struct ads1278_dev_s *dev);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct file_operations g_ads1278_fops =
{
  ads1278_open,   /* open */
  ads1278_close,  /* close */
  ads1278_read,   /* read */
  NULL,           /* write */
  NULL,           /* seek */
  ads1278_ioctl,  /* ioctl */
  NULL,           /* mmap */
  NULL,           /* truncate */
  ads1278_poll    /* poll */
};

static struct ads1278_dev_s g_ads1278 =
{
  .dma_rxreqsrc = IMXRT_DMACHAN_FLEXIO2_01,
};


/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: ads1278_open
 *
 * Description:
 *   This function is called whenever the ADS1278 device is opened.
 *
 ****************************************************************************/

static int ads1278_open(FAR struct file *filep)
{
  FAR struct inode     *inode = filep->f_inode;
  FAR struct ads1278_dev_s *dev = inode->i_private;
  uint8_t               tmp;
  int                   ret;

  /* If the port is the middle of closing, wait until the close is
   * finished.
   */

  ret = nxmutex_lock(&dev->closelock);
  if (ret >= 0)
    {
      /* Increment the count of references to the device. If this is the
       * first time that the driver has been opened for this device, then
       * initialize the device.
       */

      tmp = dev->ocount + 1;
      if (tmp == 0)
        {
          /* More than 255 opens; uint8_t overflows to zero */

