EdgeProIOT/incubator-nuttx/boards/arm/imxrt/imxrt1170-evk/src/imxrt_ads1278.c
          ret = -EMFILE;
        }
      else
        {
          /* Check if this is the first time that the driver has been
           * opened.
           */

          if (tmp == 1)
            {
              /* Yes.. perform one time hardware initialization. */

              irqstate_t flags = enter_critical_section();

              /* Mark the FIFOs empty */

              dev->recv.head = 0;
              dev->recv.tail = 0;

              /* Clear overrun indicator */

              dev->isovr = false;

              ads1278_initialize(dev);

              leave_critical_section(flags);
            }

          /* Save the new open count on success */

          dev->ocount = tmp;
        }

      nxmutex_unlock(&dev->closelock);
    }

  return ret;
}

/****************************************************************************
 * Name: ads1278_close
 *
 * Description:
 *   This routine is called when the ADS1278 device is closed.
 *
 ****************************************************************************/

static int ads1278_close(FAR struct file *filep)
{
  FAR struct inode     *inode = filep->f_inode;
  FAR struct ads1278_dev_s *dev = inode->i_private;
  irqstate_t            flags;
  int                   ret;

  ret = nxmutex_lock(&dev->closelock);
  if (ret >= 0)
    {
      /* Decrement the references to the driver. If the reference count will
       * decrement to 0, then uninitialize the driver.
       */

      if (dev->ocount > 1)
        {
          dev->ocount--;
          nxmutex_unlock(&dev->closelock);
        }
      else
        {
          /* There are no more references to the port */

          dev->ocount = 0;

          flags = enter_critical_section();    /* Disable interrupts */

          /* TODO: Disable the ADS1278 */

          leave_critical_section(flags);

          nxmutex_unlock(&dev->closelock);
        }
    }

  return ret;
}

/****************************************************************************
 * Name: ads1278_read
 ****************************************************************************/

static ssize_t ads1278_read(FAR struct file *filep, FAR char *buffer,
                            size_t buflen)
{
  FAR struct inode     *inode = filep->f_inode;
  FAR struct ads1278_dev_s *dev = inode->i_private;
  size_t                nread;
  irqstate_t            flags;
  int                   ret = 0;
  int                   datalen = sizeof(uint32_t);

  if (buflen >= datalen)
    {
      /* Interrupts must be disabled while accessing the receive FIFO */

      flags = enter_critical_section();

      while (dev->recv.head == dev->recv.tail)
        {
          /* Check if there was an overrun, if set we need to return EIO */

          if (dev->isovr)
            {
              dev->isovr = false;
              ret = -EIO;
              goto return_with_irqdisabled;
            }

          /* The receive FIFO is empty -- was non-blocking mode selected? */

          if (filep->f_oflags & O_NONBLOCK)
            {
              ret = -EAGAIN;
              goto return_with_irqdisabled;
            }

          /* Wait for a data to be received */

          dev->nrxwaiters++;
          ret = nxsem_wait(&dev->recv.sem);
          dev->nrxwaiters--;
          if (ret < 0)
            {
              goto return_with_irqdisabled;
            }
        }

      /* The receive FIFO is not empty. Copy all buffered data that will fit
       * in the user buffer.
       */

      nread = 0;

      do
        {
          uint32_t *data = &dev->recv.buffer[dev->recv.head];

          /* Will the next data in the FIFO fit into the user buffer? */

          if (nread + datalen > buflen)
            {
              /* No, break out of the loop now with nread equal to the
               * actual number of bytes transferred.
               */

              break;
            }

          /* Copy the data to the user buffer */

          memcpy(&buffer[nread], data, sizeof(uint32_t));

          nread += datalen;

          /* Increment the head of the circular data buffer */

          if (++dev->recv.head >= 2)
            {
              dev->recv.head = 0;
            }
        }
      while (dev->recv.head != dev->recv.tail);

      /* All of the data have been transferred. Return the number of
       * bytes that were read.
       */

      ret = nread;

return_with_irqdisabled:
      leave_critical_section(flags);
    }

  return ret;
}

/****************************************************************************
 * Name: ads1278_ioctl
 ****************************************************************************/

static int ads1278_ioctl(FAR struct file *filep, int cmd, unsigned long arg)
{
  FAR struct inode *inode = filep->f_inode;
  FAR struct ads1278_dev_s *dev = inode->i_private;
  int ret;

  switch (cmd)
    {
    case ANIOC_RESET_FIFO:
    {
      ret = ads1278_reset_fifo(dev);
    }
    break;

    default:
      break;
    }

  return ret;
}

/****************************************************************************
 * Name: ads1278_receive
 ****************************************************************************/

static void ads1278_receive(FAR struct ads1278_dev_s *dev, uint32_t *rxbuf)
{
  FAR struct ads1278_fifo_s *fifo = &dev->recv;
  uint32_t *rxdata = &fifo->buffer[fifo->tail];
  int i, j;
  int nexttail;

  /* Check if adding this new message would over-run the drivers ability to
   * enqueue read data.
   */

  nexttail = fifo->tail + 1;
  if (nexttail >= 2)
    {
      nexttail = 0;
    }

  imxrt_gpio_write(GPIO_DEBUG_PIN, 1);

  rxbuf[8]  = (rxbuf[0] & 0x7fffff80) >> 7;
  rxbuf[9]  = (rxbuf[0] & 0x0000007f) << 17;
  SIGN_EXTEND_24BIT(rxbuf[8]);
 
  rxbuf[9] |= (rxbuf[1] & 0xffff8000) >> 15;
  rxbuf[10]  = (rxbuf[1] & 0x00007fff) << 9;
  SIGN_EXTEND_24BIT(rxbuf[9]);
  
  rxbuf[10] |= (rxbuf[2] & 0xff800000) >> 23;
  rxbuf[11]  = (rxbuf[2] & 0x007fffff) << 1;
  SIGN_EXTEND_24BIT(rxbuf[10]);
  
  rxbuf[11] |= (rxbuf[3] & 0x80000000) >> 31;
  rxbuf[12]  = (rxbuf[3] & 0x7fffff80) >> 7;
  rxbuf[13]  = (rxbuf[3] & 0x0000007f) << 17;
  SIGN_EXTEND_24BIT(rxbuf[11]);
  SIGN_EXTEND_24BIT(rxbuf[12]);
  
