EdgeProIOT/incubator-nuttx/boards/arm/imxrt/imxrt1170-evk/src/imxrt_ads1278.c
  rxbuf[13] |= (rxbuf[4] & 0xffff8000) >> 15;
  rxbuf[14]  = (rxbuf[4] & 0x00007fff) << 9;
  SIGN_EXTEND_24BIT(rxbuf[13]);
 
  rxbuf[14] |= (rxbuf[5] & 0xff800000) >> 23;
  rxbuf[15]  = (rxbuf[5] & 0x007fffff) << 1;
  SIGN_EXTEND_24BIT(rxbuf[14]);
  
  rxbuf[15] |= (rxbuf[6] & 0x80000000) >> 31;
  SIGN_EXTEND_24BIT(rxbuf[15]);

  memcpy(&rxbuf[0], &rxbuf[8], 32);

  for (i = 16, j = 8; i < 256; i += 16, j += 8)
    {
      rxbuf[j]  = (rxbuf[i] & 0x7fffff80) >> 7;
      rxbuf[j + 1]  = (rxbuf[i] & 0x0000007f) << 17;
      SIGN_EXTEND_24BIT(rxbuf[j]);
     
      rxbuf[j + 1] |= (rxbuf[i + 1] & 0xffff8000) >> 15;
      rxbuf[j + 2]  = (rxbuf[i + 1] & 0x00007fff) << 9;
      SIGN_EXTEND_24BIT(rxbuf[j + 1]);
      
      rxbuf[j + 2] |= (rxbuf[i + 2] & 0xff800000) >> 23;
      rxbuf[j + 3]  = (rxbuf[i + 2] & 0x007fffff) << 1;
      SIGN_EXTEND_24BIT(rxbuf[j + 2]);
      
      rxbuf[j + 3] |= (rxbuf[i + 3] & 0x80000000) >> 31;
      rxbuf[j + 4]  = (rxbuf[i + 3] & 0x7fffff80) >> 7;
      rxbuf[j + 5]  = (rxbuf[i + 3] & 0x0000007f) << 17;
      SIGN_EXTEND_24BIT(rxbuf[j + 3]);
      SIGN_EXTEND_24BIT(rxbuf[j + 4]);
      
      rxbuf[j + 5] |= (rxbuf[i + 4] & 0xffff8000) >> 15;
      rxbuf[j + 6]  = (rxbuf[i + 4] & 0x00007fff) << 9;
      SIGN_EXTEND_24BIT(rxbuf[j + 5]);
     
      rxbuf[j + 6] |= (rxbuf[i + 5] & 0xff800000) >> 23;
      rxbuf[j + 7]  = (rxbuf[i + 5] & 0x007fffff) << 1;
      SIGN_EXTEND_24BIT(rxbuf[j + 6]);
      
      rxbuf[j + 7] |= (rxbuf[i + 6] & 0x80000000) >> 31;
      SIGN_EXTEND_24BIT(rxbuf[j + 7]);
    }
  
  /* Refuse the new data if the FIFO is full */

  if (nexttail != fifo->head)
    {

      /* Add the new, decoded ADS1278 buffer address at the tail of the FIFO */

      *rxdata = (uint32_t)rxbuf;

      /* Increment the tail of the circular buffer */

      fifo->tail = nexttail;

      ads1278_notify(dev);
    }

  imxrt_gpio_write(GPIO_DEBUG_PIN, 0);
}

/****************************************************************************
 * Name: ads1278_notify
 ****************************************************************************/

static void ads1278_notify(FAR struct ads1278_dev_s *dev)
{
  FAR struct ads1278_fifo_s *fifo = &dev->recv;

  /* If there are threads waiting on poll() for data to become available,
   * then wake them up now.
   */

  poll_notify(dev->fds, CONFIG_ADS1278_NPOLLWAITERS, POLLIN);

  /* If there are threads waiting for read data, then signal one of them
   * that the read data is available.
   */

  if (dev->nrxwaiters > 0)
    {
      nxsem_post(&fifo->sem);
    }
}

/****************************************************************************
 * Name: ads1278_poll
 ****************************************************************************/

static int ads1278_poll(
  FAR struct file *filep,
  struct pollfd *fds,
  bool setup)
{
  FAR struct inode *inode = filep->f_inode;
  FAR struct ads1278_dev_s *dev = inode->i_private;
  irqstate_t flags;
  int ret = 0;
  int i;

  /* Interrupts must be disabled while accessing the list of poll structures
   * and ad_recv FIFO.
   */

  flags = enter_critical_section();

  if (setup)
    {
      /* Ignore waits that do not include POLLIN */

      if ((fds->events & POLLIN) == 0)
        {
          ret = -EDEADLK;
          goto return_with_irqdisabled;
        }

      /* This is a request to set up the poll.  Find an available
       * slot for the poll structure reference
       */

      for (i = 0; i < CONFIG_ADS1278_NPOLLWAITERS; i++)
        {
          /* Find an available slot */

          if (!dev->fds[i])
            {
              /* Bind the poll structure and this slot */

              dev->fds[i] = fds;
              fds->priv   = &dev->fds[i];
              break;
            }
        }

      if (i >= CONFIG_ADS1278_NPOLLWAITERS)
        {
          fds->priv    = NULL;
          ret          = -EBUSY;
          goto return_with_irqdisabled;
        }

      /* Should we immediately notify on any of the requested events? */

      if (dev->recv.head != dev->recv.tail)
        {
          poll_notify(dev->fds, CONFIG_ADS1278_NPOLLWAITERS, POLLIN);
        }
    }
  else if (fds->priv)
    {
      /* This is a request to tear down the poll. */

      struct pollfd **slot = (struct pollfd **)fds->priv;

      /* Remove all memory of the poll setup */

      *slot                = NULL;
      fds->priv            = NULL;
    }

return_with_irqdisabled:
  leave_critical_section(flags);
  return ret;
}

/****************************************************************************
 * Name: ads1278_reset_fifo
 ****************************************************************************/

static int ads1278_reset_fifo(FAR struct ads1278_dev_s *dev)
{
  irqstate_t flags;
  FAR struct ads1278_fifo_s *fifo = &dev->recv;

  /* Interrupts must be disabled while accessing the receive FIFO */

  flags = enter_critical_section();

  fifo->head = fifo->tail;

  leave_critical_section(flags);

  return OK;
}

/****************************************************************************
 * Name: ads1278_register
 ****************************************************************************/

static int ads1278_register(
  FAR const char *path,
  FAR struct ads1278_dev_s *dev)
{
  int ret;

  DEBUGASSERT(path != NULL && dev != NULL);

  /* Initialize the ADS1278 device structure */

  dev->ocount = 0;

  /* Initialize semaphores & mutex */

  nxsem_init(&dev->recv.sem, 0, 0);
  nxmutex_init(&dev->closelock);

  /* Register the ADS1278 character driver */

  ret = register_driver(path, &g_ads1278_fops, 0444, dev);
  if (ret < 0)
    {
      nxsem_destroy(&dev->recv.sem);
      nxmutex_destroy(&dev->closelock);
    }

  return ret;
}

/****************************************************************************
 * Name: ads1278_initialize
 *
 * Description:
 *   Initialize the ADS1278 I2S in its default state
 *   (Master, 32-bit, etc.)
 *
 * Input Parameters:
 *   dev - private ADS1278 device structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void ads1278_initialize(struct ads1278_dev_s *dev)
{
  struct flexio_dev_s *flexio = dev->flexio;
  struct flexio_shifter_config_s shifter_config = {0};
  struct flexio_timer_config_s timer_config     = {0};

  flexio->ops->reset(flexio);

  shifter_config.timer_select   = FLEXIO_BCLK_TIMER_INDEX;
  shifter_config.pin_select     = FLEXIO_RX_DATA_PIN;
  shifter_config.timer_polarity = FLEXIO_SHIFTER_TIMER_POLARITY_ON_NEGATIVE;
  shifter_config.pin_config     = FLEXIO_PIN_CONFIG_OUTPUT_DISABLED;
  shifter_config.pin_polarity   = FLEXIO_PIN_ACTIVE_HIGH;
  shifter_config.shifter_mode   = FLEXIO_SHIFTER_MODE_RECEIVE;
  shifter_config.input_source   = FLEXIO_SHIFTER_INPUT_FROM_PIN;
  shifter_config.shifter_stop   = FLEXIO_TIMER_STOP_BIT_DISABLED;
  shifter_config.shifter_start  =
    FLEXIO_SHIFTER_START_BIT_DISABLED_LOAD_DATA_ON_ENABLE;

  flexio->ops->set_shifter_config(
    flexio,
    FLEXIO_RX_SHIFTER_INDEX,
    &shifter_config);

  /* Set Timer for bit clock */

  timer_config.trigger_select   = 0;
  timer_config.trigger_polarity = FLEXIO_TIMER_TRIGGER_POLARITY_ACTIVE_HIGH;
  timer_config.trigger_source   = FLEXIO_TIMER_TRIGGER_SOURCE_INTERNAL;
  timer_config.pin_select       = FLEXIO_BCLK_PIN;
  timer_config.pin_config       = FLEXIO_PIN_CONFIG_OUTPUT;
  timer_config.pin_polarity     = FLEXIO_PIN_ACTIVE_HIGH;
  timer_config.timer_mode       = FLEXIO_TIMER_MODE_DUAL8_BIT_BAUD_BIT;
  timer_config.timer_output     =
    FLEXIO_TIMER_OUTPUT_ONE_NOT_AFFECTED_BY_RESET;
  timer_config.timer_decrement  =
    FLEXIO_TIMER_DEC_SRC_ON_FLEX_IO_CLOCK_SHIFT_TIMER_OUTPUT;
  timer_config.timer_reset      = FLEXIO_TIMER_RESET_NEVER;
  timer_config.timer_disable    = FLEXIO_TIMER_DISABLE_NEVER;
  timer_config.timer_enable     = FLEXIO_TIMER_ENABLED_ALWAYS;
  timer_config.timer_start      = FLEXIO_TIMER_START_BIT_DISABLED;
  timer_config.timer_stop       = FLEXIO_TIMER_STOP_BIT_DISABLED;
  timer_config.timer_compare    = 63 << 8 | 2; /* 5MHz BCLK frequency */

  flexio->ops->set_timer_config(
    flexio,
    FLEXIO_BCLK_TIMER_INDEX,
    &timer_config);

  /* Set Timer for frame sync */

  timer_config.trigger_select   =
    FLEXIO_TIMER_TRIGGER_SEL_TIMn(FLEXIO_BCLK_TIMER_INDEX);
  timer_config.trigger_polarity = FLEXIO_TIMER_TRIGGER_POLARITY_ACTIVE_HIGH;
  timer_config.trigger_source   = FLEXIO_TIMER_TRIGGER_SOURCE_INTERNAL;
  timer_config.pin_select       = FLEXIO_FRAME_SYNC_PIN;
  timer_config.pin_config       = FLEXIO_PIN_CONFIG_OUTPUT;
  timer_config.pin_polarity     = FLEXIO_PIN_ACTIVE_HIGH;
  timer_config.timer_mode       = FLEXIO_TIMER_MODE_SINGLE16_BIT;
  timer_config.timer_output     =
    FLEXIO_TIMER_OUTPUT_ONE_NOT_AFFECTED_BY_RESET;
  timer_config.timer_decrement  =
    FLEXIO_TIMER_DEC_SRC_ON_TRIGGER_INPUT_SHIFT_TIMER_OUTPUT;
  timer_config.timer_reset      = FLEXIO_TIMER_RESET_NEVER;
  timer_config.timer_disable    = FLEXIO_TIMER_DISABLE_NEVER;
  timer_config.timer_enable     = FLEXIO_TIMER_ENABLE_ON_PREV_TIMER_ENABLE;
  timer_config.timer_start      = FLEXIO_TIMER_START_BIT_DISABLED;
  timer_config.timer_stop       = FLEXIO_TIMER_STOP_BIT_DISABLED;
  timer_config.timer_compare    = 512U - 1; /* 512 BCLK periods for one FSYNC (pos and neg edge) */

  flexio->ops->set_timer_config(
    flexio,
    FLEXIO_FS_TIMER_INDEX,
    &timer_config);

  if (dev->dma_rxreqsrc != 0)
    {
      if (dev->rxdma == NULL)
        {
          dev->rxdma = imxrt_dmach_alloc(dev->dma_rxreqsrc |
                                         DMAMUX_CHCFG_ENBL, 0);
          DEBUGASSERT(dev->rxdma);
        }
    }
  else
    {
      dev->rxdma = NULL;
    }

