EdgeProIOT/incubator-nuttx/boards/arm/imxrt/imxrt1170-evk/src/imxrt_ads1278.c
  up_invalidate_dcache((uintptr_t)dev->rxbuf,
                       (uintptr_t)dev->rxbuf + 2048U);

  /* Set up the DMA */

  struct imxrt_edma_xfrconfig_s config;

  config.saddr  = flexio->ops->get_shifter_buffer_address(
                    flexio,
                    FLEXIO_SHIFTER_BUFFER_BIT_SWAPPED,
                    FLEXIO_RX_SHIFTER_INDEX);
  config.daddr  = (uint32_t)&dev->rxbuf[0];
  config.soff   = 0;
  config.doff   = 4;
  config.iter   = 512;
  config.flags  = EDMA_CONFIG_LINKTYPE_LINKNONE |
                  EDMA_CONFIG_LOOPDEST | 
                  EDMA_CONFIG_INTHALF |
                  EDMA_CONFIG_INTMAJOR;
  config.ssize  = EDMA_32BIT;
  config.dsize  = EDMA_32BIT;
  config.nbytes = 4;

  imxrt_dmach_xfrsetup(dev->rxdma, &config);

  /* Start the DMA */

  ads1278_dmarxstart(dev);

  flexio->ops->enable(flexio, true);
}

/****************************************************************************
 * Name: ads1278_dmarxcallback
 *
 * Description:
 *   Called when the RX DMA completes
 *
 ****************************************************************************/

static void ads1278_dmarxcallback(DMACH_HANDLE handle, void *arg, bool done,
                                  int result)
{
  struct ads1278_dev_s *dev = (struct ads1278_dev_s *)arg;
  
  up_invalidate_dcache((uintptr_t)dev->rxbuf,
                       (uintptr_t)dev->rxbuf + 2048U);

  if (done)
    {
      ads1278_receive(dev, &dev->rxbuf[256]);
    }
  else
    {
      ads1278_receive(dev, &dev->rxbuf[0]);
    }
}

/****************************************************************************
 * Name: ads1278_dmarxstart
 *
 * Description:
 *   Start RX DMA
 *
 ****************************************************************************/

static inline void ads1278_dmarxstart(struct ads1278_dev_s *dev)
{
  struct flexio_dev_s *flexio = dev->flexio;

  flexio->ops->enable_shifter_status_dma(
    flexio,
    1u << FLEXIO_RX_SHIFTER_INDEX,
    true);
  flexio->ops->clear_shifter_status_flags(
    flexio,
    1u << FLEXIO_RX_SHIFTER_INDEX);

  imxrt_dmach_start(dev->rxdma, ads1278_dmarxcallback, dev);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: imxrt_ads1278_initialize
 *
 * Description:
 *   Initialize the ADS1278 device
 *
 * Returned Value:
 *   Valid device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

void imxrt_ads1278_initialize(void)
{
  struct ads1278_dev_s *dev = &g_ads1278;
  struct flexio_dev_s *flexio;
  int ret;

  imxrt_config_gpio(GPIO_FLEXIO2_FSYNC);
  imxrt_config_gpio(GPIO_FLEXIO2_BCLK);
  imxrt_config_gpio(GPIO_FLEXIO2_RX);

  /* REMOVE: Debugging*/

  imxrt_config_gpio(GPIO_DEBUG_PIN);        /* GPIO_AD_14 */

  /* End Debugging */

  flexio = imxrt_flexio_initialize(2);

  DEBUGASSERT(flexio);

  dev->flexio = flexio;

  /* Register the ADS1278 driver at "/dev/ads" */

  ret = ads1278_register("/dev/ads", dev);
  if (ret < 0)
    {
      _err("ERROR: ads1278_register ads failed: %d\n", ret);
    }

  ////////////TEST
  // {
  //   int fd;
  //   uint32_t buffer[8];

  //   fd  = open("/dev/ads", O_RDONLY);
  //   while (1)
  //     {
  //       ret = read(fd, buffer, 32);
  //       if (ret < 0)
  //         {
  //           ret = 0;
  //           _err("ERROR: ads1278 read failed: %d\n", ret);
  //         }
  //     }
  // }
  ////////////END TEST
}
